<template>
  <body>
    <div class="text-box">
      <h1 class="research-title"> 複合領域のシステム設計 </h1>
      <p>
        制御系は様々なシステムによって構成されている。
        <ul>
          <li> 制御演算装置： 制御対象の状態を監視し，入力を決定する。</li>
          <li> 駆動装置：制御演算装置の決定した制御入力をアクチュエータに与えるように供給エネルギを制御する。</li>
          <li> アクチュエータ：駆動装置から与えられたエネルギを物理運動に変換する。</li>
          <li> 運動変換装置：アクチュエータの単純な運動を複雑な運動に変換する。 </li>
          <li> センサ：制御対象の状態を監視する。</li>
        </ul>
      </p>
      <div class="pic-container">
        <img src="@/pic/problem/primitive_control_system.png" class="pic-primitive">
      </div>
      <p>
        制御系を構築ためには，全ての装置を適切に設計する必要がある。そのためには計算機科学，パワーエレクトロニクス，電磁気学，機械工学，信号処理など様々な分野に精通する必要がある。制御系は全ての構成要素を接続して一巡ループを作るという特性上，構成要素の一番性能の低い要素に左右されるという特徴があり，一部を高性能にしても全体の性能は向上しない。制御演算器の設計により他要素の不足点を補うことも多少は可能だが，原理的に補償に止まるため，性能の低い要素の底上げを行う方が安定した性能向上を示す。
      </p>

      <h2 class="research-subtitle"> 人間の運動とのアナロジ</h2>
      <p>
        制御系構築において全体要素の高性能化が必要であることを示すために，人間の制御機構を紹介する。はじめに，人間を制御系と見立てて，アクチュエータ，駆動装置，制御装置とセンサとなる部分を示す。続いて，人間が使用可能な運動変換機構について紹介する。
      </p>

      <h3 class="research-subsubtitle"> アクチュエータ </h3>
      <p>
        人間の動力の貯蔵および利用は，アデノシン3リン酸(Adenosine triphosphate: ATP)と呼ばれる化学物質を介して行われる。リン酸1分子の結合および分解によって12~14 kcal/molのエネルギの貯蔵と放出を実現し，生体のエネルギー通貨と呼ばれる。ATPを筋肉に供給することで，筋肉の運動に必要なエネルギ源が準備される。筋肉では，ミオシンがATPを加水分解することで得られた化学エネルギがミオシンの運動エネルギに変換され，ミオシンおよびアクチンのフィラメントの滑り運動を介して筋収縮といった機械エネルギに変換にされる。ここで，ATPは次第に枯渇するため，分解生成されたアデノシン2リン酸(Adenosine diphosphate: ADP)を使用してATPを再合成する機構，またはATPを産生する機構が必要となる。この再合成および産生の経路にはATP-CP系，乳酸系，有酸素系と呼ばれる3つの経路が存在し，総称してATP産生機構と呼ぶ。
      </p>
      <h3 class="research-subsubtitle"> 駆動装置 </h3>
      <p>
        運動の調節は，ミオシンの活動量を調整することで実現される。アクチン上のミオシン結合部位はトロポミオシンと呼ばれる化学物質で塞がれており，トロポミオシンを動かすことで運動量が調節できる。この運動量の調節は，脳によって発生される運動指令を介して行われる。運動指令は活動電位の形式で運動神経を介して運動神経と筋肉の接合部である神経筋接合部に伝達される。活動電位の伝達により，様々な過程を経て筋細胞内のカルシウム濃度が変化する。ここで，人体にはアロステリックモジュレータと呼ばれる，タンパク質の機能を他の化合物によって調整可能な化学物質が存在する。筋細胞にはカルシウムと結合してトロポミオシンを移動させるトロポニンと呼ばれる調節タンパク質が存在する。つまり，筋にはカルシウム濃度の変化によりトロポミオシンを移動し，筋収縮制御を可能とするアロステリック制御機構が備わっている。脳から発せられた運動指令は間接的に筋細胞内のカルシウム濃度を調整し，筋収縮量を調整する。
      </p>
      <h3 class="research-subsubtitle"> 制御演算装置とセンサ </h3>
      <p>
        運動の調節に際して，活動電位の決定には脳による状況判断を伴う。状況判断には人間が備える視覚，聴覚，触覚などの多彩な感覚器官を使用する。大脳には各感覚器に対応する処理系が存在し，各感覚器からの信号から必要な点を抽出し，統合することで状況判断を行う。ここで，理想状態と現状を比較し，現状を修正するように活動電位を調整する。この調整には大脳と小脳の双方が機能する。
      </p>
      <h3 class="research-subsubtitle"> 運動変換装置 </h3>
      <p> 筋は分散アクチュエータであり，骨格は運動を統制，拘束するものであると見ることができる。その点で骨格は運動変換装置であるが，人間はさらに複雑な運動変換装置を日常生活において無数に使用する。それは道具であり，包丁を使えば素材を切断することができ，延べ棒を使えば素材を引き延ばすことができる。エネルギの変換であることに変わりはないが，道具を使用することで手指の運動エネルギを多様な形式へと変化させることができる。この運動変換装置の交換が自由自在という利点により，人間は作業において高い汎用性を示す。 </p>

      <h2 class="research-subtitle"> 全体要素の統合設計の重要性 </h2>
      <p>
        ここでは人間が複雑なタスクを行うに当たって各機構がどのように働くかを確認し，全体要素の性能向上の重要性を確認する。難しいタスクの例として，カタヌキを取り上げる。カタヌキとは板状の菓子に描かれた動物や星、桜などの型を針や爪楊枝などを使って刳り貫く遊戯を指す。
      </p>
      <div class="pic-container">
        <img src="@/pic/problem/human_operation.png" class="pic-human-ope">
      </div>
      <p>
        まず運動変換機構にあたる道具について，先端が丸くなった針では上手に削れないので，適切な選定が必要となる。そして，道具が良くても繊細な力加減がなければ菓子を割らずに刳り貫くことは難しいので，アクチュエータにあたる手指と駆動装置にあたるアロステリック制御機構が高い応答性を示す必要がある。また，繊細な力加減を実現できたとしても，状況判断を誤れば菓子を割る削り方をしてしまうので，適切に状態を観測するセンサと状態を判断する計算機が必要となる。最後に，状況判断の結果から適切な力加減と削り速度を指令する制御器が必要となる。このように，各要素がタスク達成に重要な要素を有しており，全てが成立しない場合にはタスクの達成が困難となる。
      </p>

      <vue-mathjax :formula="f_kinetic_energy" />

      <ul class="footer">
        
        <li class="article-title-f title-sp">
          <router-link class="article-link-f" to="/research">
          > TOP
          </router-link>
        </li>

        <li class="article-title-f title-left">
          <router-link class="article-link-f" />
        </li>

        <li class="article-title-f title-center">
          <router-link class="article-link-f" to="/research">
          > TOP
          </router-link>
        </li>

        <li class="article-title-f title-right">
          <router-link class="article-link-f" to="/research/articles/problem/phaselag">
            > 位相遅れによる制御性能の限界
          </router-link>
        </li>
      </ul>

    </div>
  </body>
</template>

<script>
  import { VueMathjax } from "vue-mathjax"
  export default {
    components: {
      "vue-mathjax": VueMathjax,
    },
    data () {
      return {

        f_kinetic_energy: "$$ \\begin{eqnarray} \\end{eqnarray} $$",

      }
    },
  }
</script>

<style scoped>
body{
  background: #fff;
}

.pic-primitive{
  width:90%;
  max-width:500px;
  margin:10px;
}

.pic-human-ope{
  width:90%;
  max-width:130px;
  margin:10px;
}

</style>
